{
  "Add Ballot group": "Adicionar grupo de boletins",
  "Ballot group": "Grupo de boletins",
  "vote": "voto",
  "votes": "votos",
  "Votes": "Votos",
  "Token count must be at least 1": "O número de tokens deve ser pelo menos 1",
  "Ballot Tokens": "Tokens de Votação",
  "Copied!": "Copiado!",
  "Copy All as CSV": "Copiar Todos como CSV",
  "Ballot tokens allow voters to access their unique voting page. Share these links individually or export all as CSV.": "Os tokens de votação permitem que os eleitores acedam ao seu boletim único. Partilhe estes links individualmente ou exporte todos como CSV.",
  "Important: Each token should be shared with exactly one person. Tokens are unique to each voter and should not be reused or shared publicly.": "Importante: Cada token deve ser partilhado com exatamente uma pessoa. Os tokens são únicos para cada eleitor e não devem ser reutilizados ou partilhados publicamente.",
  "Create New Tokens": "Criar Novos Tokens",
  "Number of tokens": "Número de tokens",
  "Creating...": "A criar...",
  "Create Tokens": "Criar Tokens",
  "No ballot tokens have been created yet.": "Ainda não foram criados tokens de votação.",
  "Used on {{date}}": "Usado em {{date}}",
  "Not used yet": "Ainda não usado",
  "No preference": "Sem preferência",
  "seats": "lugares",
  "candidates": "candidatos",
  "cast": "expressos",
  "voters": "eleitores",
  "Voting is open": "A votação está aberta",
  "Voting is closed": "A votação está encerrada",
  "App title": "Hub Eleitoral",
  "Simulate": "Simular",
  "Elections": "Eleições",
  "STV guide": "Guia de STV",
  "Admin Guide": "Guia do Administrador",
  "Admin Guide meta description": "Guia completo para administradores eleitorais. Aprenda a criar eleições, gerar tokens de boletim, distribuí-los aos votantes e publicar resultados.",
  "Create a new election": "Criar uma nova eleição",
  "Set the title, description, candidates, number of seats, and start/end dates.": "Defina o título, descrição, candidatos, número de vagas e datas de início/fim.",
  "When you create an election, you'll receive a unique admin page URL. Save this link and share it only with other trusted administrators.": "Quando cria uma eleição, receberá um URL único da página de administração. Guarde este link e partilhe-o apenas com outros administradores de confiança.",
  "Generate voting tokens": "Gerar tokens de votação",
  "On the admin page, generate ballot tokens for each voter. Each token is a unique secret link that grants access to one ballot.": "Na página de administração, gere tokens de boletim para cada eleitor. Cada token é um link secreto único que concede acesso a um boletim.",
  "Generate as many tokens as you have eligible voters. You can create tokens in batches.": "Gere tantos tokens quantos eleitores elegíveis tiver. Pode criar tokens em lotes.",
  "Distribute tokens to voters": "Distribuir tokens aos votantes",
  "Send each token link individually to the respective voter. The voter should redeem the token privately - only they will have access to their ballot.": "Envie cada link de token individualmente ao respetivo eleitor. O eleitor deve resgatar o token privadamente - apenas ele terá acesso ao seu boletim.",
  "Important: tokens can only be redeemed while the election is open. The system ensures ballot anonymity: administrators cannot see which ballot corresponds to which token.": "Importante: os tokens só podem ser resgatados enquanto a eleição estiver aberta. O sistema garante o anonimato do boletim: os administradores não podem ver qual boletim corresponde a qual token após o resgate.",
  "Monitor election progress": "Acompanhar o progresso da eleição",
  "Track voting progress on the admin page. You can see how many tokens have been redeemed and how many ballots have been cast.": "Acompanhe o progresso da votação na página de administração. Pode ver quantos tokens foram resgatados e quantos boletins foram expressos.",
  "You cannot see how individual voters voted. All ballots are anonymous once cast.": "Não pode ver como os eleitores individuais votaram. Todos os boletins são anónimos uma vez expressos.",
  "Close and publish results": "Encerrar e publicar resultados",
  "After the voting period ends, results are calculated automatically and published on the public election page.": "Após o término do período de votação, os resultados são calculados automaticamente e publicados na página pública da eleição.",
  "The system shows elected candidates, Copeland ranking, detailed counting rounds, and the pairwise comparison matrix.": "O sistema mostra os candidatos eleitos, classificação Copeland, rondas de contagem detalhadas e a matriz de comparação par a par.",
  "This guide is for election administrators - members of an electoral commission or individuals delegated by the commission to manage an election.": "Este guia é para administradores eleitorais - membros de uma comissão eleitoral ou indivíduos delegados pela comissão para gerir uma eleição usando o sistema STV.",
  "Understanding Election Pages": "Compreender as Páginas de Eleição",
  "Each election has two pages:": "Cada eleição tem duas páginas:",
  "Public Page": "Página Pública",
  "This is where election results are published and voters can view election details. Safe to share publicly.": "É aqui que os resultados da eleição são publicados e os eleitores podem ver os detalhes da eleição. Seguro para partilhar publicamente.",
  "Admin Page": "Página de Administração",
  "This page is created when you set up a new election and provides full control: generate tokens, edit details, and manage voting. Share only with trusted administrators.": "Esta página é criada quando configura uma nova eleição e fornece controlo total: gerar tokens, editar detalhes e gerir a votação. Partilhe apenas com administradores de confiança.",
  "Steps for Administrators:": "Passos para Administradores:",
  "This ballot id does not exist": "Este ID de boletim não existe",
  "Invalid ballot URL": "URL de boletim inválido",
  "Error loading ballot": "Erro ao carregar boletim",
  "Ballot not found": "Boletim não encontrado",
  "Cast Your Ballot": "Vote",
  "Ballot meta description": "Voto nesta eleição STV. Ordene os candidatos por preferência para participar na tomada de decisões democráticas.",
  "Private Ballot: Do not share this page URL with anyone. This link is unique to your vote and should be kept confidential.": "Boletim Privado: Não partilhe o URL desta página com ninguém. Este link é único para o seu boletim e deve ser mantido confidencial.",
  "Voting Period": "Período de Votação",
  "Ballot saved successfully!": "Boletim guardado com sucesso!",
  "Error saving ballot": "Erro ao guardar boletim",
  "Rank the candidates": "Classifique os candidatos",
  "Select your preferred rank for each candidate. 1 is most preferred.": "Selecione a classificação preferida para cada candidato. 1 é o mais preferido.",
  "Saving...": "A guardar...",
  "Submit Ballot": "Submeter Boletim",
  "Create Election": "Criar Eleição",
  "Admin": "Administrador",
  "Title is required": "O título é obrigatório",
  "At least 2 candidates are required": "São necessários pelo menos 2 candidatos",
  "Number of seats must be between 1 and the number of candidates": "O número de lugares deve estar entre 1 e o número de candidatos",
  "Start and end times are required": "As horas de início e fim são obrigatórias",
  "Invalid date format": "Formato de data inválido",
  "End time must be after start time": "A hora de fim deve ser posterior à hora de início",
  "Back to elections": "Voltar às eleições",
  "Error loading election": "Erro ao carregar eleição",
  "Election not found": "Eleição não encontrada",
  "Election Admin meta description": "Interface administrativa para gerir eleições. Crie eleições, gere tokens de boletim e acompanhe o progresso da votação.",
  "View Public Page": "Ver Página Pública",
  "Copy Public Link": "Copiar Link Público",
  "Administrator Page": "Página de Administrador",
  "This page allows full control over the election. Only share this URL with people you trust to administer this election.": "Esta página permite controlo total sobre a eleição. Partilhe este URL apenas com pessoas em quem confia para administrar esta eleição.",
  "Copy": "Copiar",
  "Election not found.": "",
  "Create New Election": "Criar Nova Eleição",
  "Edit Election Details": "Editar Detalhes da Eleição",
  "Title, description, and candidates are locked because voting tokens have been redeemed.": "O título, descrição e candidatos estão bloqueados porque os tokens de votação já foram usados.",
  "Election Title": "Título da Eleição",
  "Description": "Descrição",
  "Number of Seats": "Número de Lugares",
  "Candidates": "Candidatos",
  "Add Candidate": "Adicionar candidato",
  "Candidate": "Candidato",
  "Start Time": "Hora de Início",
  "End Time": "Hora de Fim",
  "Save Changes": "Guardar Alterações",
  "Cancel": "Cancelar",
  "Election Details": "Detalhes da Eleição",
  "turnout": "participação",
  "Results": "Resultados",
  "Position": "Posição",
  "Open in Simulator": "Abrir no Simulador",
  "Pairwise Comparison Matrix": "Matriz de Comparação Par a Par",
  "Each cell shows how many voters preferred the row candidate over the column candidate": "Cada célula mostra quantos eleitores preferiram o candidato da linha ao candidato da coluna",
  "Candidates are ordered by their final ranking (Copeland method). Green cells indicate wins, yellow indicates ties.": "Os candidatos são ordenados pela classificação final (método Copeland). Células verdes indicam vitórias, amarelas indicam empates.",
  "Ballot Groups": "Grupos de Boletins",
  "unique patterns": "padrões únicos",
  "total votes": "votos totais",
  "Individual Ballots": "Boletins Individuais",
  "Click to view ballot details": "Clique para ver detalhes do boletim",
  "Detailed Counting Log": "Registo Detalhado de Contagem",
  "Results will be available after voting is complete": "Os resultados estarão disponíveis após a conclusão da votação",
  "Elections meta description": "Navegue e participe em eleições STV. Veja eleições ativas, expresse o seu voto e consulte resultados transparentes.",
  "Error loading elections": "Erro ao carregar eleições",
  "No elections available": "Nenhuma eleição disponível",
  "Meta description": "Plataforma de eleições STV segura, transparente e auditável. Execute eleições de representação proporcional com o método de Meek, gira tokens de boletim e fornece total transparência de resultados.",
  "Meta description short": "Plataforma de eleições STV segura, transparente e auditável. Execute eleições de representação proporcional com o método de Meek.",
  "heroSubtitle": "Votação justa, transparente e proporcional por escolha preferencial",
  "View Elections": "Ver Eleições",
  "Try Simulator": "Experimentar Simulador",
  "createElectionTitle": "Criar",
  "createElectionDesc": "Configure a sua própria eleição STV. Defina candidatos, períodos de votação e distribua tokens de voto seguros aos eleitores. Perfeito para clubes, organizações e comunidades.",
  "participateTitle": "Participar",
  "participateDesc": "Emita o seu voto em eleições ativas usando ligações de boletim seguras. As suas escolhas são privadas e contadas com precisão usando o algoritmo STV.",
  "Go to Elections": "Ir para Eleições",
  "experimentTitle": "Experimentar",
  "experimentDesc": "Experimente o simulador interativo para entender como o STV funciona. Crie as suas próprias eleições, adicione candidatos e veja resultados em tempo real.",
  "whatIsSTVTitle": "O que é o STV?",
  "whatIsSTVPara1": "O Voto Único Transferível (STV) é um sistema de votação proporcional que garante uma representação justa. Os eleitores classificam os candidatos por ordem de preferência, e o algoritmo garante que os votos não são desperdiçados — se a sua primeira escolha não puder ganhar ou já tiver ganho, o seu voto é transferido para a sua próxima preferência.",
  "whatIsSTVPara2": "Isto torna o STV ideal para eleger múltiplos vencedores numa única disputa, dando aos grupos minoritários uma oportunidade justa enquanto respeita as preferências da maioria. É usado em eleições reais em todo o mundo, desde conselhos locais a legislaturas nacionais.",
  "Try it yourself": "Experimente você mesmo",
  "View live elections": "Ver eleições ao vivo",
  "technicalDetailsTitle": "Como funciona",
  "technicalDetailsPara1": "Este site implementa o STV usando o método de Meek com a quota de Droop, um algoritmo preciso e amplamente reconhecido para eleições proporcionais por escolha preferencial. O motor de contagem subjacente é de código aberto, desenvolvido por Guillaume Endignoux, um engenheiro da Google.",
  "technicalDetailsPara2": "Para fornecer uma classificação estilo pódio dos candidatos eleitos, complementamos os resultados do STV usando o método de Copeland — uma abordagem bem conhecida baseada na comparação par a par de preferências em todos os boletins. Isto significa que os candidatos são primeiro selecionados pelo STV para justiça, depois ordenados de acordo com a força de preferência dos eleitores.",
  "technicalDetailsFooter": "Todos os dados eleitorais, boletins e registos detalhados são publicados após o encerramento da votação, garantindo total transparência e auditabilidade.",
  "Participate Now": "Participar Agora",
  "View Source Code": "Ver Código Fonte",
  "readyToStartTitle": "Pronto para começar?",
  "readyToStartDesc": "Navegue pelas eleições ativas para emitir o seu voto, ou experimente o simulador para explorar como o STV funciona com os seus próprios cenários.",
  "Browse Elections": "Explorar Eleições",
  "Elected candidates": "Candidatos eleitos",
  "Number of seats to elect": "Número de lugares a eleger",
  "numberOfSeatsInstructions": "Número de lugares\n\nDefina quantos candidatos serão eleitos neste concurso.\nO valor não pode ser inferior a 1 nem superior ao número total de candidatos.",
  "Simulate meta description": "Simule eleições STV com candidatos e boletins personalizados. Teste diferentes cenários e veja rondas de contagem e resultados detalhados.",
  "addCandidatesInstructions": "Adicione os seus candidatos\n\nIntroduza os nomes dos candidatos abaixo.\n- Clique em Adicionar candidato para acrescentar mais.\n- Clique em Remover para apagar um candidato.\n- Pode renomear candidatos a qualquer momento.",
  "You can change the candidate's name here.": "Pode alterar o nome do candidato aqui.",
  "At least one candidate is required": "É necessário pelo menos um candidato.",
  "Remove this candidate": "Remover este candidato",
  "Remove": "Remover",
  "Click to add a new candidate to the list": "Clique para adicionar um novo candidato à lista",
  "Ballot groups": "Grupos de boletins",
  "editBallotsInstructions": "Como editar boletins:\n- Introduza o número de eleitores representados por cada boletim.\n- Classifique os candidatos (1 = primeira escolha, 2 = segunda, ...); deixe em branco para \"sem preferência\".\n- Candidatos classificados de forma igual são contabilizados de forma igual.\n- Utilize Adicionar grupo de boletins para novos grupos de votação.\n- Remova os boletins de que não necessita.",
  "Running...": "A executar...",
  "Run Election": "Executar eleição",
  "Combined Ballots": "Boletins Combinados",
  "Detailed STV log": "Registo detalhado do STV",
  "Load/Save election": "Carregar/Guardar eleição",
  "Edit election YAML here...": "Edite aqui o YAML da eleição...",
  "loadSaveYamlInstructions": "Carregar/Guardar eleição YAML\nCole YAML válido para atualizar a configuração da eleição.\nCopie este campo para exportar a configuração atual.\nAs alterações serão aplicadas automaticamente se o YAML for válido.",
  "STV Explainer meta description": "Aprenda como funciona o Voto Único Transferível (STV). Entenda representação proporcional, cálculos de quota e o método de Meek para eleições justas.",
  "stvMd.keyFeatureMinWaste": "Minimiza o número de votos desperdiçados",
  "stvMd.keyFeatureMaxProp": "Maximiza a proporcionalidade das preferências",
  "stvMd.keyFeatureComplex": "À custa de um método de contagem mais complexo",
  "stvMd.keyFeatureMinTactical": "Reduz o voto tático: os eleitores podem classificar honestamente todas as preferências sem medo de desperdiçar o seu voto",
  "stvMd.inputCandidates": "Uma lista de candidatos",
  "stvMd.inputSeats": "Um número de lugares a eleger (`n`)",
  "stvMd.inputVotes": "Um conjunto de votos válidos (total `t`), onde cada um atribui uma classificação a qualquer número de candidatos.",
  "stvMd.transferDefeated": "Quando a preferência mais alta é derrotada, o voto é transferido para a próxima preferência",
  "stvMd.transferElected": "Quando a preferência mais alta é eleita, a proporção do voto não usada para eleger é transferida para a próxima preferência",
  "stvMd.noWasteCaseMajority": "um único candidato tem uma preferência muito alta pela maioria",
  "stvMd.noWasteCaseMinority": "um candidato tem uma preferência muito alta por uma minoria",
  "stvMd.refGendignoux": "Voto Único Transferível (STV) - gendignoux.com",
  "stvMd.refMeek": "Método de Meek - Wikipédia",
  "stvMd.refDroop": "Quota de Droop - Wikipédia",
  "stvMd.refUNSW": "Vídeo da Universidade de New South Wales sobre STV",
  "stvMd.refElectoralCommission": "Explicação do STV pela Comissão Eleitoral do Reino Unido",
  "stvMd.intro1": "O método STV-MD (Single Transferable Vote com contagem de Meek e quota de Droop) é um sistema unimonial de representação proporcional para eleições com múltiplos vencedores, que combina o algoritmo iterativo de transferência de Meek com a quota de Droop para atribuir lugares de forma justa e refletir com precisão as preferências ordenadas dos eleitores.",
  "stvMd.intro2": "É usado para eleger N lugares entre M candidatos.",
  "stvMd.keyFeaturesTitle": "Propriedades principais",
  "stvMd.inputsTitle": "Entradas",
  "stvMd.inputsIntro": "O método requer votos onde os eleitores classificam candidatos por preferência. Assim, precisa de:",
  "stvMd.exampleTitle": "Exemplo",
  "stvMd.exampleCandidates": "Lista de candidatos: `[Maçã, Banana, Cereja]`",
  "stvMd.exampleSeats": "Número de lugares a eleger: 2",
  "stvMd.exampleVotesTitle": "Conjunto de votos válidos:",
  "stvMd.exampleVote1": "voto 1: `[2, 1, None]` (Banana > Maçã, sem preferência por Cereja)",
  "stvMd.exampleVote2": "voto 2: `[1, 1, 2]` (Maçã = Banana > Cereja)",
  "stvMd.exampleVote3": "voto 3: `[3, 2, 1]` (Cereja > Banana > Maçã)",
  "stvMd.iterationsTitle": "Como o método funciona",
  "stvMd.iterationsIntro1": "O método funciona em iterações.",
  "stvMd.iterationsIntro2": "No início, cada voto conta 1, e este valor é atribuído à(s) preferência(s) mais alta(s). Em cada iteração, os candidatos são classificados como derrotados (menor contagem de preferência mais alta entre os votos) ou eleitos (acima do limiar para ser eleito). Quando derrotado ou eleito, o voto é transferido para o próximo candidato da seguinte forma:",
  "stvMd.transferRulesTitle": "Regras de transferência",
  "stvMd.noWasteTitle": "Porque os votos não são desperdiçados",
  "stvMd.noWasteIntro": "Isto garante que os votos nos dois casos em que",
  "stvMd.noWasteConclusion": "não são desperdiçados porque, em ambos os casos, o \"restante\" do voto é transferido para a próxima preferência do voto.",
  "stvMd.referencesTitle": "Referências",
  "Token Redeem meta description": "Resgatar o seu token de boletim para aceder à sua página de votação. Este é o seu link privado para expressar o seu voto na eleição.",
  "Token Already Redeemed": "Token Já Resgatado",
  "Vote": "Vote",
  "This token has already been redeemed. Each token can only be used once. If you previously redeemed this token, you should have received a ballot link.": "Este token já foi resgatado. Cada token só pode ser usado uma vez. Se já resgatou este token anteriormente, deverá ter recebido um link de boletim.",
  "You have been invited to vote in this election. Click the button below to access your ballot.": "Foi convidado a votar nesta eleição. Clique no botão abaixo para aceder ao seu boletim.",
  "Important: After continuing, you will receive a unique link to your ballot. This current link will no longer work. Do not share the ballot link with anyone, as it allows direct access to your vote.": "Importante: Após continuar, receberá um link único para o seu boletim. Este link atual deixará de funcionar. Não partilhe o link do boletim com ninguém, pois permite acesso direto ao seu voto.",
  "Loading...": "A carregar...",
  "Continue to Vote": "Continue para Votar"
}
